// 1.
// Дано три цілих числа: a, b, c. Перевірте істинність висловлювання:
//     a < b < c

// let a = 1;
// let b = 2;
// let c = 3;
// console.log(a<b<c);



// 2.
// Є такий код:

// let x = 1;
// let y = 2;
//
// let res1 = '1' + '2'  // Допишіть код, необхідно використовувати змінні x і y
//     console.log(res1); // ""12""
// console.log(typeof res1); // ""string""
//
// let res2 = '2' + true // Допишіть код, необхідно використовувати змінні x і y
//     console.log(res2); // ""true2""
// console.log(typeof res2); // ""string""
//
// let res3 = Boolean(y-x) // Допишіть код, необхідно використовувати змінні x і y
//     console.log(res3); // true
// console.log(typeof res3); // ""boolean""
//
// let res4 = true / false // Допишіть код, необхідно використовувати змінні x і y
//     console.log(res4); // NaN
// console.log(typeof res4); // ""number""


// Допишіть код, щоб в консолі браузера з'явилися рядки, які написані в коментарях, оперуючи при цьому змінними х і у.

// 3.
// Використовуючи функцію prompt() задайте користувачу питання про досягнення ним повнолітнього віку. Результат запишіть в змінну isAdult. В залежності від отриманого значення виведіть відповідне повідомлення про статус особи. Наприклад: при виконанні умови вік більше 18 вивести “Ви досягли повнолітнього віку”. Якщо вік менше 18 років вивести “Ви ще надто молоді”,
//

// let isAdult = prompt('Скільки вам років?');
// function adultResult(age){
//     if(age >= 18){
//         console.log('Ви досягли повнолітнього віку')
//     }
//     else{
//         console.log('Ви ще надто молоді')
//     }
// }
// adultResult(isAdult)



// 4.
// Задано масив чисел, знайти число яке найбільш часто входить в масив, занести це число в новий масив і видалити всі входження цього числа із поточного масиву.
//     let arr = [4, 5, 2, 1, 6, 5, 3, 5, 2, 5]
// let data = ... // 5
// ...
// console.log(arr) // [4, 2, 1, 6, 3, 2]
//
// let arr = [4, 5, 2, 1, 6, 5, 3, 5, 2, 5]
// let newArr = [];
//
// function masUpdate(oldMas,newMas){
//     let count = 0;
//     for(let i = 0; i < oldMas.length; i++){
//         for(let j = 0 ; j < oldMas.length; j++){
//             if(oldMas[i] === oldMas[j]){
//                 count++
//             }
//             else{
//                 continue
//             }
//         }
//         if (count === 1){
//             newMas.push(oldMas[i])
//             count = 0;
//         }
//         else{
//             count = 0;
//         }
//
//     }
//     console.log(newMas)
// }
// masUpdate(arr, newArr)

// 5.
// Користувач вводить три довжини сторін трикутника (використовуйте prompt () три рази для введення кожної сторони).
// Необхідно
// a) визначити і вивести в консоль площу трикутника
// b) перевірити чи цей трикутник є прямокутним і вивести в консоль результат перевірки.
//     Здійснювати перевірку чи введені користувачем значення коректні, в іншому випадку вивести 'Incorrect data‘. Результат обчислення площі трикутника виводити в консоль з точністю 3 знаки після коми (наприклад:  8.42355465 =>  8.424).
//

// let firstSide = +prompt('Введіть довжину сторони А')
// let secondSide = +prompt('Введіть довжину сторони В')
// let thirdSide = +prompt('Введіть довжину сторони С')
//
// function triangle(a,b,c){
//     if (a + b <= c || a + c <= b || b + c <= a){
//         return 'Ви ввели неправильні дані'
//     }
//     const s = (a+b+c) / 2;
//     console.log(`Площа трикутника = ${s}`)
//     let maxSide = Math.max(a,b,c);
//     if (Math.pow(maxSide , 2) === Math.pow(a,2) + Math.pow(b, 2) + Math.pow(c,2) - Math.pow(maxSide,2)){
//         return console.log('Це прямокутний трикутник')
//     }
//     else{
//         return console.log('Це не є прямокутний трикутник')
//     }
// }
// triangle(firstSide,secondSide,thirdSide);

// 6.
// Написати умовну конструкцію, яка в залежності від часу доби виводитиме відповідне привітання. Потрібно отримати реальний час доби із системи. Зробити 2 способами через 2 різних умовних оператора.
//     В діапазоні годин 23-5 – має виводитися привітання “Доброї ночі”
// В діапазоні годин 5-11 – має виводитися привітання “Доброго ранку”
// В діапазоні годин 11-17 – має виводитися привітання “Доброго дня”
// В діапазоні годин 17-23 – має виводитися привітання “Доброго вечора”.

// function currentTime(){
//     let date = new Date()
//     let hour = date.getHours()
//
//     console.log('Перший спосіб\n -----------')
//     if (hour >= 23 || hour < 5) {
//         console.log("Доброї ночі");
//     } else if (hour >= 5 && hour < 11) {
//         console.log("Доброго ранку");
//     } else if (hour >= 11 && hour < 17) {
//         console.log("Доброго дня");
//     } else {
//         console.log("Доброго вечора");
//     }
//     console.log('Другий спосіб\n -----------')
//     switch(true) {
//         case (hour >= 23 || hour < 5):
//             console.log("Доброї ночі");
//             break;
//         case (hour >= 5 && hour < 11):
//             console.log("Доброго ранку");
//             break;
//         case (hour >= 11 && hour < 17):
//             console.log("Доброго дня");
//             break;
//         default:
//             console.log("Доброго вечора");
//     }
// }
// currentTime()